/**
 * 对外暴露的方法列表：
 * 1.getBankLogo
 * 2.getDisplay 调用方法如下
 * var param1= require('../core/param1');
 * alert(param1.getDisplay('DEPOSIT_TYPE','1'));
	
 */
define(function(require, exports, module) {
	var param = {
		//存款类型
		DEPOSIT_TYPE: {
			'0': '定期存款',
			'1': '活期存款'
		},
		//手机验证模式
		MODEID_TYPE: '000100',
		//手机app广告开关 首页是否加入广告页
		AD_SWITCH: false,
		SOFTPWD_SWITCH: false,
		//凭证状态类型
		ACCOUNT_TYPE: {
			"0": "正常",
			"1": "只收不付",
			"2": "不收不付",
			"3": "部分冻结",
			"4": "全部冻结",
			"5": "质押",
			"6": "账户挂失",
			//"7":"待销毁",
			"8": "结息待清户",
			"9": "已销户"
		},
		BANK_LOGO: {
			'102': '102.png', //'中国工商银行'  ,
			'103': '103.png', //'中国农业银行'  ,
			'104': '104.png', //'中国银行'  ,
			'105': '105.png', //'中国建设银行'  ,
			//'201':'国家开发银行'  ,
			//'202':'中国进出口银行'  ,
			//'203':'中国农业发展银行'  ,
			'301': '301.png', //'交通银行'  ,
			'302': '302.png', //'中信实业银行'  ,
			'303': '303.png', //'中国光大银行'  ,
			'304': '304.png', //'华夏银行'  ,
			'305': '305.png', //'中国民生银行'  ,
			'306': '306.png', //'广东发展银行'  ,
			//'307':'深圳发展银行'  ,
			'308': '308.png', //'招商银行'  ,
			'309': '309.png', //'兴业银行'  ,
			'310': '310.png', //'上海浦东发展银行'  ,
			//'313':'城市商业银行'  ,
			/*'315':'恒丰银行'  ,
			'316':'浙商银行'  ,*/
			'401': '401.png', //'城市信用合作社'  ,
			'402': '402.png', //'农村信用合作社'  ,
			'403': '403.png', //'国家邮政局邮政储汇' ,
			/*'501':'汇丰银行'  ,
			'502':'东亚银行'  ,
			'503':'南洋商业银行'  ,
			'504':'恒生银行'  ,
			'505':'中国银行（香港）有限公司'  ,
			'506':'集友银行有限公司'  ,
			'509':'星展银行（香港）有限公司'  ,
			'510':'永亨银行有限公司'  ,
			'531':'美国花旗银'  ,
			'532':'美国银行有限公司'  ,
			'561':'日本东京三菱银行'  ,
			'562':'日本日联银行'  ,
			'563':'日本三井住友银行'  ,
			'564':'日本瑞穗实业银行'  ,
			'565':'日本山口银行'  ,
			'591':'韩国外换银行'  ,
			'593':'韩国友利银行'  ,
			'594':'韩国产业银行'  ,
			'596':'韩国中小企业银行'  ,
			'623':'新加坡星展银行'  ,
			'651':'比利时联合银行'  ,
			'661':'荷兰银行有限公司'  ,
			'671':'英国渣打银行'  ,
			'693':'法国东方汇理银行股份有限公司'  ,
			'694':'法国东方汇理银行股份有限公司'  ,
			'711':'德国德累斯登银行'  ,
			'712':'德意志银行'  ,
			'713':'德国商业银行'  ,
			'741':'瑞士信贷第一波士顿银行'  ,
			'761':'澳大利亚和新西兰银行集团'  ,
			'781':'厦门国际银行'  ,
			'782':'法国巴黎银行（中国）有限公司'  ,*/
			'783': '783.png' //'平安银行有限责任公司'  ,
				/*'787':'华一银行'  ,
				'901':'中央国债登记结算有限责任公司'  ,
				'902':'公开市场业务操作室'  ,
				'903':'中国外汇交易'  ,
				'904':'城市商业银行资金清'  ,
				'905':'中国银联股份有限公司'  ,
				'969':'(澳门地区)'  ,
				'989':'(香港地区)'  			*/
		},

		/*生产版本*/
		BANK_TYPE: {
			'102': '中国工商银行',
			'103': '中国农业银行',
			'104': '中国银行',
			'105': '中国建设银行',
			'201': '国家开发银行',
			'202': '中国进出口银行',
			'203': '中国农业发展银行',
			'301': '交通银行',
			'302': '中信实业银行',
			'303': '中国光大银行',
			'304': '华夏银行',
			'305': '中国民生银行',
			'306': '广东发展银行',
			'307': '深圳发展银行',
			'308': '招商银行',
			'309': '兴业银行',
			'310': '上海浦东发展银行',
			'313': '城市商业银行',
			'315': '恒丰银行',
			'316': '浙商银行',
			'401': '城市信用合作社',
			'402': '农村信用合作社',
			'403': '国家邮政局邮政储汇',
			'501': '汇丰银行',
			'502': '东亚银行',
			'503': '南洋商业银行',
			'504': '恒生银行',
			'505': '中国银行（香港）有限公司',
			'506': '集友银行有限公司',
			'509': '星展银行（香港）有限公司',
			'510': '永亨银行有限公司',
			'531': '美国花旗银',
			'532': '美国银行有限公司',
			'561': '日本东京三菱银行',
			'562': '日本日联银行',
			'563': '日本三井住友银行',
			'564': '日本瑞穗实业银行',
			'565': '日本山口银行',
			'591': '韩国外换银行',
			'593': '韩国友利银行',
			'594': '韩国产业银行',
			'596': '韩国中小企业银行',
			'623': '新加坡星展银行',
			'651': '比利时联合银行',
			'661': '荷兰银行有限公司',
			'671': '英国渣打银行',
			'693': '法国东方汇理银行股份有限公司',
			'694': '法国东方汇理银行股份有限公司',
			'711': '德国德累斯登银行',
			'712': '德意志银行',
			'713': '德国商业银行',
			'741': '瑞士信贷第一波士顿银行',
			'761': '澳大利亚和新西兰银行集团',
			'781': '厦门国际银行',
			'782': '法国巴黎银行（中国）有限公司',
			'783': '平安银行有限责任公司',
			'787': '华一银行',
			'901': '中央国债登记结算有限责任公司',
			'902': '公开市场业务操作室',
			'903': '中国外汇交易',
			'904': '城市商业银行资金清',
			'905': '中国银联股份有限公司',
			'969': '(澳门地区)',
			'989': '(香港地区)'
		},
		BANK_TYPE_MERGE: {
			//'102':'中国工商银行'  ,
			//'103':'中国农业银行'  ,
			//'104':'中国银行'  ,
			//'105':'中国建设银行'  ,
			'201': '国家开发银行',
			'202': '中国进出口银行',
			'203': '中国农业发展银行',
			//'301':'交通银行'  ,
			//'302':'中信实业银行'  ,
			//'303':'中国光大银行'  ,
			//'304':'华夏银行'  ,
			//'305':'中国民生银行'  ,
			//'306':'广东发展银行'  ,
			//'307':'深圳发展银行'  ,
			//'308':'招商银行'  ,
			//'309':'兴业银行'  ,
			//'310':'上海浦东发展银行'  ,
			'313': '城市商业银行',
			//'315':'恒丰银行'  ,
			//'316':'浙商银行'  ,
			'401': '城市信用合作社',
			'402': '农村信用合作社',
			'403': '国家邮政局邮政储汇',
			'501': '汇丰银行',
			'502': '东亚银行',
			'503': '南洋商业银行',
			'504': '恒生银行',
			'505': '中国银行（香港）有限公司',
			'506': '集友银行有限公司',
			'509': '星展银行（香港）有限公司',
			'510': '永亨银行有限公司',
			'531': '美国花旗银',
			'532': '美国银行有限公司',
			'561': '日本东京三菱银行',
			'562': '日本日联银行',
			'563': '日本三井住友银行',
			'564': '日本瑞穗实业银行',
			'565': '日本山口银行',
			'591': '韩国外换银行',
			'593': '韩国友利银行',
			'594': '韩国产业银行',
			'596': '韩国中小企业银行',
			'623': '新加坡星展银行',
			'651': '比利时联合银行',
			'661': '荷兰银行有限公司',
			'671': '英国渣打银行',
			'693': '法国东方汇理银行股份有限公司',
			'694': '法国东方汇理银行股份有限公司',
			'711': '德国德累斯登银行',
			'712': '德意志银行',
			'713': '德国商业银行',
			'741': '瑞士信贷第一波士顿银行',
			'761': '澳大利亚和新西兰银行集团',
			'781': '厦门国际银行',
			'782': '法国巴黎银行（中国）有限公司',
			'783': '平安银行有限责任公司',
			'787': '华一银行',
			'901': '中央国债登记结算有限责任公司',
			'902': '公开市场业务操作室',
			'903': '中国外汇交易',
			'904': '城市商业银行资金清',
			'905': '中国银联股份有限公司',
			'969': '(澳门地区)',
			'989': '(香港地区)'
		},
		CARD_TYPE: {
			'1': '活期',
			'2': '定期',
			'3': '贷款',
			'4': '信用卡',
			'5': '股票',
			'6': '基金',
			'9': '内部账户'
		},
		RISK_LEVEL_MEAN: {
			'0': 'R1（谨慎型）',
			'1': 'R2（稳健型）',
			'2': 'R3（平衡型）',
			'3': 'R4（进取型）',
			'4': 'R5（激进型）'
		},
		CURRENCY_TYPE_CODE: {
			'01': '人民币',
			'14': '美元',
			'13': '港币',
			'38': '欧元',
			'27': '日元',
			'16': '卢布',
			'12': '英镑',
			'18': '新加坡元',
			'28': '加元',
			'29': '澳元',
			'87': '新西兰元'
		}
	};
	
	exports.getBankLogo = function(ucode) {
		var picpath = "";
		if(ucode) {
			picpath = param.BANK_LOGO[ucode.substr(0, 3) + ''];
		}
		return picpath;
	};
	/**
	 * 根据类型名称 和id获取value
	 * @param appName 类型名称
	 * @param appValue 类型id
	 * @returns
	 */
	exports.getDisplay = function(appName, appValue) {
		
		var map = null;

		if(typeof(appName) === 'string') {
			map = param[appName];
		} else {
			map = appName;
		}

		if(arguments.length == 1){
			return map;	
		}else if(arguments.length == 2){
			appValue = trim(appValue);
			return map[appValue];
		}
	};
	/**
	 * 根据类型名称获取select下的option参数
	 * @param appName 类型名称
	 * @param selectCode 默认选择项
	 * @param filter 过滤器
	 * @param blankSelect 是否有空白项，false/true
	 *  	document.body.innerHTML = '<select id=aaa></select>';
	 * 		document.getElementById("aaa").innerHTML = param1.getSelect('DEPOSIT_TYPE','','','');
	 * @returns
	 */
	exports.getSelect = function( appName, selectCode, filter, blankSelect ) {
		var html = "";
		
		var map =null;
		
		if(typeof(appName)==='string'){
			map =param[ appName ];
		}else{
			map=appName;
		}
		
		if ( !map ) {
			mui.alert( "param: " + appName + " not defined!");
			return null;
		}
		if(blankSelect)
			html += "<option value=\"\">请选择</option>";
		
		for(var key in map){
			var value = map[key];
			if(filter) {
				if(filter.include(key))
					continue;
			}
			if ( selectCode && selectCode == key ) {
				html += "<option value=\""+key+"\" areaName=\""+value+"\" selected=\"selected\">"+value+"</option>";
			}
			else {
				html += "<option value=\""+key+"\" areaName=\""+value+"\">"+value+"</option>";
			}
		}
		return html;
	};
	
	var trim = function(input) {
		return input.replace(/(^\s*)|(\s*$)/g, "");
	};

});